---
kind: type
id: T:Autodesk.Revit.DB.FailureHandlingOptions
source: html/c03bb2e5-f679-bf24-4e87-08b3c3a08385.htm
---
# Autodesk.Revit.DB.FailureHandlingOptions

Options to control how failures (if any occurred during the transaction)
 should be handled at the time the transaction is being ended.

## Syntax (C#)
```csharp
public class FailureHandlingOptions : IDisposable
```